import os
from sqlalchemy import create_engine

layout = dict(
    autosize=True,
    automargin=True,
    margin=dict(l=30, r=30, b=20, t=40),
    hovermode="closest",
    plot_bgcolor="#F9F9F9",
    paper_bgcolor="#F9F9F9",
    legend=dict(font=dict(size=10), orientation="h")
)

engine = create_engine('sqlite:///' + os.path.join('C:', os.sep, 'Users', 'KhasyRa1','db_local', 'hrdata.db'))

colors_le = {
    'ГРС': ['rgba(130, 100, 230, 1)', 'rgba(130, 100, 230, 0.4)'],
    'РЗ': ['rgba(100, 230, 150, 1)', 'rgba(100, 230, 150, 0.4)'],
    'Медкорп': ['rgba(100, 165, 230, 1)', 'rgba(100, 165, 230, 0.4)'],
    'ИнРос-Мед': ['rgba(215, 230, 100, 1)', 'rgba(215, 230, 100, 0.4)'],
    'БОС': ['rgba(230, 180, 100, 1)', 'rgba(230, 180, 100, 0.4)'],
    'Интач': ['rgba(230, 115, 100, 1)', 'rgba(230, 115, 100, 0.4)'],
    'Прочее': ['rgba(230, 100, 230, 1)', 'rgba(230, 100, 230, 0.4)'],
    'РЕНПРАЙМ': ['rgba(230, 100, 230, 1)', 'rgba(230, 100, 230, 0.4)'],
    'ВЕЛБИ': ['rgba(230, 100, 230, 1)', 'rgba(230, 100, 230, 0.4)'],
    'Холдинг РС': ['rgba(230, 100, 230, 1)', 'rgba(230, 100, 230, 0.4)'],
    'Ренинс Финанс': ['rgba(230, 100, 230, 1)', 'rgba(230, 100, 230, 0.4)'],
    'РенКонсалт': ['rgba(230, 100, 230, 1)', 'rgba(230, 100, 230, 0.4)'],
    'Ренессанс пенсии': ['rgba(230, 100, 230, 1)', 'rgba(230, 100, 230, 0.4)'],
}

colors_groups = {
    '0: Активен': ['rgba(20, 170, 20, 1)'],
    '1: 90 дней': ['rgba(230, 20, 20, 1)'],
    '2: 3-12 мес.': ['rgba(200, 20, 20, 1)'],
    '3: 1-2 года': ['rgba(170, 20, 20, 1)'],
    '4: 2-5 лет': ['rgba(140, 20, 20, 1)'],
    '5: 5+ лет': ['rgba(110, 20, 20, 1)'],
    '9: Техническое увольнение': ['rgba(150, 150, 150, 1)'],
}